joelanders/mame-profligacy/src/devices/cpu/tms57002/jit/tms57002_ops.cpp
// license:BSD-3-Clause
//
// TMS57002 dynarec op-emitter (milestone 1). See tms57002_ops.h.
//
// Each op-id emits a standalone memory-based body reproducing the interpreter's ex_N bit-exact.
// Semantics are transcribed from tmsinstr.lst (the DSL the interpreter is generated from) and driven
// by the generated CINTRPDESC variant-descriptor table. The per-op gate proves each one against the
// oracle over randomized states. Correctness only here: state lives in the device struct (no register
// residency, no cmem fast-path — cmem reads call get_cmem directly, always bit-exact). Milestone 2
// re-emits these SAME lowerings under a pinned-register convention for residency.
//
// Deferred (return false -> gate skips, dynarec deopts): %mo/%mn/%mv macc-output ops (add/sub with m,
// smh*/sml*/slm*), sfma!=0 mac pre-shift, serial I/O (dis/domh/dos), branches (bgz/blz/bnz/bv, -> M3).
#include "tms57002_ops.h"

// ===== Arch-independent core: descriptor table + coverage predicate ==============================
// Shared by both backends so they can never diverge on WHICH ops are pooled (coverage parity by
// construction); only the lowerings below are per-arch, and the byte-identity gate checks those.
#if defined(__x86_64__) || defined(__aarch64__)
#include <cstring>
#include <cstdint>
#include <vector>

// Generated op-id -> (mnemonic, cat, id, decomposed variant bits, type) descriptor table.
namespace {
#define CINTRPDESC
#include "cpu/tms57002/tms57002.hxx"
#undef CINTRPDESC
}  // namespace

namespace tms57002 {

unsigned tms_op_desc_count() {
	return unsigned(sizeof(tms57002_op_desc) / sizeof(tms57002_op_desc[0]));
}

// Does this poolable op's body READ cmem (via cmem_into)? Such ops must deopt to the
// interpreter under pending CMEM updates (so get_cmem drains the queue with correct
// timing) when KPROP_PF4_CMEM_DEOPT is on. This is exact by descriptor form: treating a
// DMEM-only form as a reader needlessly deopts it on every pending update, while missing
// a real reader would DIVERGE in the PF4 CMEM oracle. CMEM-WRITE ops (sacc/smhc) write
// raw and are NOT queue-consuming -> excluded.
bool op_reads_cmem(tms57002_device &dsp, unsigned op) {
	const unsigned n = tms_op_desc_count();
	if (op < 4 || op >= n) return false;
	const tms57002_opdesc_t &d = tms57002_op_desc[op];
	if (!d.mn || !d.mn[0]) return false;
	const char *mn = d.mn;
	auto is = [&](const char *s) { return std::strcmp(mn, s) == 0; };
	(void)dsp;
	// Direct %c loads.
	if (is("lacc") || is("lmhc")) return true;
	// Logic forms are base+0=%d,a, base+1=%c,a, base+2=%d,%c.
	if (is("and")) return d.id != 0x14;
	if (is("or"))  return d.id != 0x17;
	if (is("xor")) return d.id != 0x1a;
	// add/sub low nibbles: %d,a and %d,m are DMEM-only; the remaining forms read %c.
	if (is("add") || is("sub")) {
		const unsigned lo = d.id & 0x0f;
		return lo == 0x04 || lo == 0x06 || lo == 0x07
			|| lo == 0x0a || lo == 0x0c || lo == 0x0d;
	}
	// Multiplier C-source is CMEM except for a,d / a,du and creg,d forms.
	if (is("mac"))  return d.id == 0x24 || d.id == 0x26;
	if (is("macs")) return d.id == 0x2e;
	if (is("macu")) return d.id == 0x29;
	if (is("mpy"))  return d.id == 0x21 || d.id == 0x22;
	if (is("mpyu")) return d.id == 0x28;
	return false;
}

bool op_poolable(tms57002_device &dsp, unsigned op) {
	const unsigned n = tms_op_desc_count();
	if (op < 4 || op >= n)
		return false;
	const tms57002_opdesc_t &d = tms57002_op_desc[op];
	if (!d.mn || !d.mn[0])
		return false;
	const char *mn = d.mn;
	auto is = [&](const char *s) { return std::strcmp(mn, s) == 0; };
	if (d.type == 'f') return true;   // flag-setters (affine st1)
	if (is("zmac") || is("zacc") || is("sfml") || is("sfmr")) return true;
	if (is("lcak") || is("lirk") || is("lira") || is("lcaa")) return true;   // NOT idle (sets S_IDLE -> deopt handles the check)
	if (is("lacc") || is("lacd")) return true;
	if (is("and") || is("or") || is("xor")) return true;
	if (is("neg") || is("abs")) return true;
	if (is("add") || is("sub")) return true;   // all forms (incl. %mo: %d,m / %c,m)
	if (is("sacc") || is("sacd") || is("srbd")) return true;
	if (is("smhc") || is("smhd") || is("smld") || is("slmh") || is("slml")) return true;   // %mo/%mn/%mv outputs
	if (is("lmhc") || is("lmhd") || is("lmld")) return true;   // macc loads
	if (is("dos") || is("domh")) return true;   // serial output (so[n]=v; serial cycle model excluded by the frame)
	// mac/mpy family (sfma=0 for the accumulating forms; jit_pooled_safe excludes the forward debug modes).
	if (is("mac")) return d.sfma == 0 && (d.id == 0x24 || d.id == 0x25 || d.id == 0x26);
	if (is("macs")) return d.sfma == 0 && d.id == 0x2e;
	if (is("macu")) return d.sfma == 0 && (d.id == 0x29 || d.id == 0x2a);
	if (is("mpy")) return d.id == 0x21 || d.id == 0x22 || d.id == 0x23;
	if (is("mpyu")) return d.id == 0x28;
	(void)dsp;
	return false;   // %mo (smh*/sml*/slm*)/lmh*/rde/wre/dis: later batch or deopt
}

u32 op_mode_consumed_mask(unsigned op) {
	// Built once, O(N^2) over the ~1.9k-entry descriptor table (a few ms, one-time): within a
	// (mnemonic, cat, .lst-id) family, any variant column that differs between two members was a
	// decode-selected dimension for the WHOLE family — union its ST1 mask into every member.
	// cmode/dmode are opcode-word addressing modes (not st1) and are deliberately unmapped. crm has
	// NO descriptor column — decode never enumerates it (the pooled bodies read the CRM view from
	// st1 at RUNTIME) — so CRM bits in a mode diff are consumed by nothing and reconverge at scrm.
	static const std::vector<u32> table = [] {
		const unsigned n = tms_op_desc_count();
		std::vector<u32> t(n, 0);
		for (unsigned i = 4; i < n; i++) {
			const tms57002_opdesc_t &a = tms57002_op_desc[i];
			if (!a.mn || !a.mn[0]) continue;
			for (unsigned j = i + 1; j < n; j++) {
				const tms57002_opdesc_t &b = tms57002_op_desc[j];
				if (!b.mn || !b.mn[0]) continue;
				if (a.cat != b.cat || a.id != b.id || std::strcmp(a.mn, b.mn) != 0) continue;
				u32 m = 0;
				if (a.sfai != b.sfai) m |= tms57002_device::jit_st1_sfai();
				if (a.sfao != b.sfao) m |= tms57002_device::jit_st1_sfao();
				if (a.sfma != b.sfma) m |= tms57002_device::jit_st1_sfma();
				if (a.sfmo != b.sfmo) m |= tms57002_device::jit_st1_sfmo();
				if (a.rnd  != b.rnd)  m |= tms57002_device::jit_st1_rnd_field();
				if (a.movm != b.movm) m |= tms57002_device::jit_st1_movm();
				if (a.dbp  != b.dbp)  m |= tms57002_device::jit_st1_dbp();
				t[i] |= m;
				t[j] |= m;
			}
		}
		return t;
	}();
	return op < table.size() ? table[op] : 0xffffffffu;
}

bool op_is_mode_setter(unsigned op) {
	const unsigned n = tms_op_desc_count();
	if (op < 4 || op >= n)
		return false;
	return tms57002_op_desc[op].type == 'f';
}

}  // namespace tms57002
#endif  // __x86_64__ || __aarch64__

#if defined(__x86_64__)

