joelanders/mame-profligacy/src/devices/cpu/tms57002/jit/tms57002_ops.cpp
namespace tms57002 {

namespace {
using namespace asmjit;

// C-callable device helpers the emitted bodies invoke (mirror jit_w_* in tms57002_jit.cpp).
u32 ops_get_cmem(tms57002_device *d, unsigned a) { return d->jit_get_cmem(u8(a)); }
void ops_xm_init(tms57002_device *d) { d->jit_xm_init(); }

// Device-field offsets used across the lowerings.
struct Off {
	int st1, sti, aacc, macc, macc_r, macc_w, cmem, creg, ca, id;
	int dmem0, dmem1, ba0, ba1, xoa, xwr, xrd, so;
	Off()
		: st1(int(tms57002_device::jit_off_st1()))
		, sti(int(tms57002_device::jit_off_sti()))
		, aacc(int(tms57002_device::jit_off_aacc()))
		, macc(int(tms57002_device::jit_off_macc()))
		, macc_r(int(tms57002_device::jit_off_macc_read()))
		, macc_w(int(tms57002_device::jit_off_macc_write()))
		, cmem(int(tms57002_device::jit_off_cmem()))
		, creg(int(tms57002_device::jit_off_creg()))
		, ca(int(tms57002_device::jit_off_ca()))
		, id(int(tms57002_device::jit_off_id()))
		, dmem0(int(tms57002_device::jit_off_dmem0()))
		, dmem1(int(tms57002_device::jit_off_dmem1()))
		, ba0(int(tms57002_device::jit_off_ba0()))
		, ba1(int(tms57002_device::jit_off_ba1()))
		, xoa(int(tms57002_device::jit_off_xoa()))
		, xwr(int(tms57002_device::jit_off_xwr()))
		, xrd(int(tms57002_device::jit_off_xrd()))
		, so(int(tms57002_device::jit_off_so()))
	{}
};

// %c = get_cmem(cmode ? ca : i->param), as a fresh 32-bit reg (always the real helper -> bit-exact).
x86::Gp emit_get_cmem(x86::Compiler &cc, x86::Gp dev, const Off &o, unsigned cmode, unsigned param) {
	x86::Gp addr = cc.new_gp32();
	if (cmode)
		cc.movzx(addr, x86::byte_ptr(dev, o.ca));
	else
		cc.mov(addr, Imm(param));
	InvokeNode *g = nullptr;
	cc.invoke(Out(g), uint64_t(&ops_get_cmem), FuncSignature::build<u32, tms57002_device *, unsigned>());
	g->set_arg(0, dev);
	g->set_arg(1, addr);
	x86::Gp v = cc.new_gp32();
	g->set_ret(0, v);
	return v;
}

// dmem element index (param|id + ba{dbp}) & mask{dbp}, as a fresh 64-bit reg (for [dev+idx*4+disp]).
x86::Gp emit_d_index(x86::Compiler &cc, x86::Gp dev, const Off &o, unsigned dmode, unsigned dbp, unsigned param) {
	x86::Gp addr = cc.new_gpz();
	cc.movzx(addr, x86::byte_ptr(dev, dbp ? o.ba1 : o.ba0));
	if (dmode) {
		x86::Gp idr = cc.new_gpz();
		cc.movzx(idr, x86::byte_ptr(dev, o.id));
		cc.add(addr, idr);
	} else {
		cc.add(addr, Imm(param));
	}
	cc.and_(addr, Imm(dbp ? 0x1f : 0xff));
	return addr;
}

// %d24 = dmem{dbp}[index] (raw stored 24-bit), 32-bit reg.
x86::Gp emit_load_d24(x86::Compiler &cc, x86::Gp dev, const Off &o, unsigned dmode, unsigned dbp, unsigned param) {
	x86::Gp addr = emit_d_index(cc, dev, o, dmode, dbp, param);
	x86::Gp v = cc.new_gp32();
	cc.mov(v, x86::dword_ptr(dev, addr, 2, dbp ? o.dmem1 : o.dmem0));
	return v;
}

// %d = %d24 << 8, 32-bit reg.
x86::Gp emit_load_d(x86::Compiler &cc, x86::Gp dev, const Off &o, unsigned dmode, unsigned dbp, unsigned param) {
	x86::Gp v = emit_load_d24(cc, dev, o, dmode, dbp, param);
	cc.shl(v, Imm(8));
	return v;
}

// %sfai(dst): dst = sfai ? ((int32_t)dst) >> 1 : dst  (arithmetic >>1, in place on a 32-bit reg).
void emit_sfai(x86::Compiler &cc, x86::Gp v, unsigned sfai) {
	if (sfai)
		cc.sar(v, Imm(1));
}

// %a = aacc (sfao=0) or aacc<<7 (sfao=1), fresh 32-bit reg.
x86::Gp emit_load_a(x86::Compiler &cc, x86::Gp dev, const Off &o, unsigned sfao) {
	x86::Gp a = cc.new_gp32();
	cc.mov(a, x86::dword_ptr(dev, o.aacc));
	if (sfao)
		cc.shl(a, Imm(7));
	return a;
}

// %wa(rr): aacc = saturate(s64 rr). If rr out of int32 range: st1 |= ST1_AOV, and if ST1_AOVM clamp
// to [INT32_MIN, INT32_MAX]; then aacc = (u32)rr. (tmsinstr.lst %wa; from the reference emit_wa.)
void emit_wa(x86::Compiler &cc, x86::Gp dev, const Off &o, x86::Gp rr) {
	x86::Gp chk = cc.new_gpz();
	cc.movsxd(chk, rr.r32());
	cc.cmp(chk, rr);
	Label no_ovf = cc.new_label();
	cc.je(no_ovf);
	cc.or_(x86::dword_ptr(dev, o.st1), Imm(tms57002_device::jit_st1_aov()));
	Label no_clamp = cc.new_label();
	cc.test(x86::dword_ptr(dev, o.st1), Imm(tms57002_device::jit_st1_aovm()));
	cc.jz(no_clamp);
	x86::Gp hi = cc.new_gpz(), lo = cc.new_gpz();
	cc.mov(hi, Imm(2147483647LL));
	cc.cmp(rr, hi);
	cc.cmovg(rr, hi);
	cc.mov(lo, Imm(-2147483648LL));
	cc.cmp(rr, lo);
	cc.cmovl(rr, lo);
	cc.bind(no_clamp);
	cc.bind(no_ovf);
	cc.mov(x86::dword_ptr(dev, o.aacc), rr.r32());
}

// %wd(value): dmem{dbp}[(param|id + ba{dbp}) & mask] = value & 0xffffff  (write_dmem is a masked store).
void emit_write_dmem(x86::Compiler &cc, x86::Gp dev, const Off &o, unsigned dmode, unsigned dbp, unsigned param, x86::Gp value) {
	cc.and_(value, Imm(0xffffff));
	x86::Gp addr = emit_d_index(cc, dev, o, dmode, dbp, param);
	cc.mov(x86::dword_ptr(dev, addr, 2, dbp ? o.dmem1 : o.dmem0), value);
}

// Overflow test used by the macc-output stage: set `ov` = 1 if (m & mask) is neither 0 nor mask.
void emit_ovcheck(x86::Compiler &cc, x86::Gp m, u64 mask, x86::Gp ov) {
	x86::Gp m1 = cc.new_gpz(), mk = cc.new_gpz();
	cc.mov(mk, Imm(std::int64_t(mask)));
	cc.mov(m1, m);
	cc.and_(m1, mk);
	Label no = cc.new_label();
	cc.jz(no);            // m1 == 0 -> not over
	cc.cmp(m1, mk);
	cc.je(no);            // m1 == mask -> not over
	cc.mov(ov, Imm(1));
	cc.bind(no);
}

// %mo / %mn / %mv (macc_to_output_{sfmo}[s|n] / check_macc_overflow_{sfmo}[s]). Returns the s64
// output value in a fresh reg; sets ST1_MOV and (movm=1) clamps on overflow — bit-exact with the
// interpreter's helpers. kind: 'o'=%mo, 'n'=%mn, 'v'=%mv. All constants are compile-time from
// (sfmo, movm, rnd); the op then does its own >>shift & mask on the returned value.
x86::Gp emit_macc_output(x86::Compiler &cc, x86::Gp dev, const Off &o, char kind, unsigned sfmo, unsigned movm, unsigned rnd) {
	static const u64 PRE_MASK[4] = { 0xf800000000000ULL, 0xfe00000000000ULL, 0xff80000000000ULL, 0ULL };
	static const std::int64_t ROUNDING[5] = { 0, 0x8000, 0x800000, 0x8000000, 0x80000000LL };   // [3]=1<<27 (fork RND-mode3 fix, 48-20; was 0x20000=48-30)
	static const u64 RMASK[5] = { 0xffffffffffffffffULL, 0xffffffffffff0000ULL, 0xffffffffff000000ULL, 0xfffffffff0000000ULL, 0xffffffff00000000ULL };   // [3] low 28 zeroed (48-20 fix)
	static const std::int64_t CLIP_POS[5] = { 0x00007fffffffffffLL, 0x00007fffffff0000LL, 0x00007fffff000000LL, 0x00007ffff0000000LL, 0x00007fff00000000LL };
	static const std::int64_t CLIP_NEG[5] = { std::int64_t(0xffff800000000000ULL), std::int64_t(0xffff800000000000ULL), std::int64_t(0xffff800000000000ULL), std::int64_t(0xffff800000000000ULL), std::int64_t(0xffff800000000000ULL) };
	const std::int64_t FIX_POS = 0x00007fffffffffffLL, FIX_NEG = std::int64_t(0xffff800000000000ULL);
	const u64 POST_MASK = 0xf800000000000ULL;
	if (rnd > 4) rnd = 4;

	x86::Gp mr = cc.new_gpz();   // original macc_read (for the sign test)
	cc.mov(mr, x86::qword_ptr(dev, o.macc_r));
	x86::Gp m = cc.new_gpz();
	cc.mov(m, mr);
	x86::Gp ov = cc.new_gpz();
	cc.xor_(ov, ov);

	if (kind == 'v') {
		if (sfmo != 3) {   // check_macc_overflow_3 returns macc_read unchanged
			emit_ovcheck(cc, m, PRE_MASK[sfmo], ov);
			Label noov = cc.new_label();
			cc.test(ov, ov);
			cc.jz(noov);
			cc.or_(x86::dword_ptr(dev, o.st1), Imm(tms57002_device::jit_st1_mov()));
			if (movm) {   // 's' variant: fixed clamp
				x86::Gp neg = cc.new_gpz(), mk = cc.new_gpz(), nv = cc.new_gpz();
				cc.mov(mk, Imm(std::int64_t(0x8000000000000ULL)));
				cc.mov(neg, mr); cc.and_(neg, mk);
				cc.mov(m, Imm(FIX_POS)); cc.mov(nv, Imm(FIX_NEG));
				cc.test(neg, neg); cc.cmovnz(m, nv);
			}
			cc.bind(noov);
		}
		return m;
	}

	// 'o'/'n': shift, round+mask, overflow, clamp
	if (sfmo != 3)
		emit_ovcheck(cc, m, PRE_MASK[sfmo], ov);
	if (sfmo == 1) cc.shl(m, Imm(2));
	else if (sfmo == 2) cc.shl(m, Imm(4));
	else if (sfmo == 3) cc.sar(m, Imm(8));
	if (ROUNDING[rnd]) { x86::Gp rd = cc.new_gpz(); cc.mov(rd, Imm(ROUNDING[rnd])); cc.add(m, rd); }
	{ x86::Gp rm = cc.new_gpz(); cc.mov(rm, Imm(std::int64_t(RMASK[rnd]))); cc.and_(m, rm); }
	emit_ovcheck(cc, m, POST_MASK, ov);
	Label noov = cc.new_label();
	cc.test(ov, ov);
	cc.jz(noov);
	cc.or_(x86::dword_ptr(dev, o.st1), Imm(tms57002_device::jit_st1_mov()));
	if (movm) {
		x86::Gp neg = cc.new_gpz(), mk = cc.new_gpz(), nv = cc.new_gpz();
		cc.mov(mk, Imm(std::int64_t(0x8000000000000ULL)));
		cc.mov(neg, mr); cc.and_(neg, mk);
		cc.mov(m, Imm(kind == 'o' ? CLIP_POS[rnd] : FIX_POS));
		cc.mov(nv, Imm(kind == 'o' ? CLIP_NEG[rnd] : FIX_NEG));
		cc.test(neg, neg); cc.cmovnz(m, nv);
	}
	cc.bind(noov);
	return m;
}

}  // namespace

bool emit_op_mem(x86::Compiler &cc, x86::Gp dev, tms57002_device &dsp,
                 unsigned op, unsigned param, std::uint64_t icd_addr) {
	const unsigned n = tms_op_desc_count();
	if (op < 4 || op >= n)
		return false;
	const tms57002_opdesc_t &d = tms57002_op_desc[op];
	if (!d.mn || !d.mn[0])
		return false;
	const Off o;
	const char *mn = d.mn;
	auto is = [&](const char *s) { return std::strcmp(mn, s) == 0; };

	// ---- Flag-setter ops: st1' = (st1 & keep) | set, discovered by probing the oracle.
	if (d.type == 'f') {
		const void *icd = reinterpret_cast<const void *>(icd_addr);
		const u32 v0 = dsp.jit_probe_st1(op, icd, 0x00000000u);
		const u32 vF = dsp.jit_probe_st1(op, icd, 0xffffffffu);
		const u32 setb = v0;
		const u32 keep = vF & ~setb;
		const u32 pr[2] = { 0x5a5a5a5au, 0xa5a5a5a5u };
		for (u32 p : pr)
			if (((p & keep) | setb) != dsp.jit_probe_st1(op, icd, p))
				return false;
		if (keep != 0xffffffffu)
			cc.and_(x86::dword_ptr(dev, o.st1), Imm(keep));
		if (setb != 0u)
			cc.or_(x86::dword_ptr(dev, o.st1), Imm(setb));
		return true;
	}

	// ---- Trivial register / immediate ops -------------------------------------------------
	if (is("raov")) { cc.and_(x86::dword_ptr(dev, o.st1), Imm(~tms57002_device::jit_st1_aov())); return true; }
	if (is("rmov")) { cc.and_(x86::dword_ptr(dev, o.st1), Imm(~tms57002_device::jit_st1_mov())); return true; }
	if (is("zacc")) { cc.mov(x86::dword_ptr(dev, o.aacc), Imm(0)); return true; }
	if (is("zmac")) { cc.mov(x86::qword_ptr(dev, o.macc), Imm(0)); return true; }
	if (is("lcak")) { cc.mov(x86::byte_ptr(dev, o.ca), Imm(u8(param))); return true; }
	if (is("lirk")) { cc.mov(x86::byte_ptr(dev, o.id), Imm(u8(param))); return true; }
	if (is("idle")) { cc.or_(x86::dword_ptr(dev, o.sti), Imm(tms57002_device::jit_s_idle_mask())); return true; }
	if (is("lira")) { x86::Gp a = emit_load_a(cc, dev, o, d.sfao); cc.shr(a, Imm(24)); cc.mov(x86::byte_ptr(dev, o.id), a.r8()); return true; }
	if (is("lcaa")) { x86::Gp a = emit_load_a(cc, dev, o, d.sfao); cc.shr(a, Imm(24)); cc.mov(x86::byte_ptr(dev, o.ca), a.r8()); return true; }

	// ---- Loads -----------------------------------------------------------------------------
	if (is("lacc")) {   // aacc = %c
		x86::Gp c = emit_get_cmem(cc, dev, o, d.cmode, param);
		cc.mov(x86::dword_ptr(dev, o.aacc), c);
		return true;
	}
	if (is("lacd")) {   // %sfai(d,%d); aacc = d
		x86::Gp v = emit_load_d(cc, dev, o, d.dmode, d.dbp, param);
		emit_sfai(cc, v, d.sfai);
		cc.mov(x86::dword_ptr(dev, o.aacc), v);
		return true;
	}

