joelanders/mame-profligacy/src/devices/cpu/tms57002/jit/tms57002_ops.cpp
	// ---- Logic: and / or / xor -------------------------------------------------------------
	if (is("and") || is("or") || is("xor")) {
		// forms are contiguous per mnemonic: base+0 = %d,a ; base+1 = %c,a ; base+2 = %d,%c
		const unsigned base = is("and") ? 0x14 : is("or") ? 0x17 : 0x1a;
		const unsigned form = d.id - base;   // 0=%d,a  1=%c,a  2=%d,%c
		x86::Gp res = cc.new_gp32();
		if (form == 1) {                     // %c,a : aacc OP= %c
			res = emit_get_cmem(cc, dev, o, d.cmode, param);
			if (is("and")) cc.and_(x86::dword_ptr(dev, o.aacc), res);
			else if (is("or")) cc.or_(x86::dword_ptr(dev, o.aacc), res);
			else cc.xor_(x86::dword_ptr(dev, o.aacc), res);
		} else {
			x86::Gp dv = emit_load_d(cc, dev, o, d.dmode, d.dbp, param);   // %d
			emit_sfai(cc, dv, d.sfai);
			if (form == 0) {                 // %d,a : aacc OP= d
				if (is("and")) cc.and_(x86::dword_ptr(dev, o.aacc), dv);
				else if (is("or")) cc.or_(x86::dword_ptr(dev, o.aacc), dv);
				else cc.xor_(x86::dword_ptr(dev, o.aacc), dv);
			} else {                         // %d,%c : aacc = %c OP d
				x86::Gp c = emit_get_cmem(cc, dev, o, d.cmode, param);
				if (is("and")) cc.and_(c, dv);
				else if (is("or")) cc.or_(c, dv);
				else cc.xor_(c, dv);
				cc.mov(x86::dword_ptr(dev, o.aacc), c);
			}
		}
		return true;
	}

	// ---- Arithmetic with %wa: add / sub / neg / abs (non-%mo forms only) --------------------
	if (is("neg")) {   // %wa(-(int64)(int32)%a)
		x86::Gp a = emit_load_a(cc, dev, o, d.sfao);
		x86::Gp rr = cc.new_gpz();
		cc.movsxd(rr, a);
		cc.neg(rr);
		emit_wa(cc, dev, o, rr);
		return true;
	}
	if (is("abs")) {   // .lst: aacc = %a; if((int32)aacc<0){ aacc=-aacc; if((int32)aacc<0){ st1|=AOV; [saturate] } }
		// 2026-07-05 audit: was reading aacc raw (missed the sfao<<7 %a view + the unconditional
		// `aacc = %a` write-back) and missed the fork abs-saturate silicon fix (parity with pooled).
		x86::Gp a = emit_load_a(cc, dev, o, d.sfao);
		cc.mov(x86::dword_ptr(dev, o.aacc), a);
		Label done = cc.new_label();
		cc.test(a, a);
		cc.jns(done);
		cc.neg(a);
		cc.mov(x86::dword_ptr(dev, o.aacc), a);
		cc.test(a, a);
		cc.jns(done);
		cc.or_(x86::dword_ptr(dev, o.st1), Imm(tms57002_device::jit_st1_aov()));
		if (dsp.jit_abs_saturate())
			cc.mov(x86::dword_ptr(dev, o.aacc), Imm(0x7fffffffu));
		else {
			Label no_clamp = cc.new_label();
			cc.test(x86::dword_ptr(dev, o.st1), Imm(tms57002_device::jit_st1_aovm()));
			cc.jz(no_clamp);
			cc.mov(x86::dword_ptr(dev, o.aacc), Imm(0x7fffffffu));
			cc.bind(no_clamp);
		}
		cc.bind(done);
		return true;
	}
	if (is("add") || is("sub")) {
		// forms: 0x03/0x09 %d,a ; 0x04/0x0a %c,a ; 0x07/0x0d %d,%c ; (0x05/0x06/0x0b/0x0c use %mo -> defer)
		const unsigned lo = d.id & 0xf;
		const bool is_add = is("add");
		x86::Gp lhs = cc.new_gpz(), rhs = cc.new_gpz();
		bool ok = true;
		if ((is_add && lo == 0x03) || (!is_add && lo == 0x09)) {         // %d,a : (int32)%d OP (int32)%a
			x86::Gp dv = emit_load_d(cc, dev, o, d.dmode, d.dbp, param);
			cc.movsxd(lhs, dv);
			x86::Gp a = emit_load_a(cc, dev, o, d.sfao);
			cc.movsxd(rhs, a);
		} else if ((is_add && lo == 0x04) || (!is_add && lo == 0x0a)) {  // %c,a : (int32)%c OP (int32)%a
			x86::Gp c = emit_get_cmem(cc, dev, o, d.cmode, param);
			cc.movsxd(lhs, c);
			x86::Gp a = emit_load_a(cc, dev, o, d.sfao);
			cc.movsxd(rhs, a);
		} else if ((is_add && lo == 0x07) || (!is_add && lo == 0x0d)) {  // %d,%c : (int32)%d OP (int32)%c
			x86::Gp dv = emit_load_d(cc, dev, o, d.dmode, d.dbp, param);
			cc.movsxd(lhs, dv);
			x86::Gp c = emit_get_cmem(cc, dev, o, d.cmode, param);
			cc.movsxd(rhs, c);
		} else if ((is_add && lo == 0x05) || (!is_add && lo == 0x0b)) {  // %d,m : %sfai(d,%d) OP (%mo>>16)
			x86::Gp dv = emit_load_d(cc, dev, o, d.dmode, d.dbp, param);
			emit_sfai(cc, dv, d.sfai);
			cc.movsxd(lhs, dv);
			rhs = emit_macc_output(cc, dev, o, 'o', d.sfmo, d.movm, d.rnd);
			cc.sar(rhs, Imm(16));
		} else if ((is_add && lo == 0x06) || (!is_add && lo == 0x0c)) {  // %c,m : (int32)%c OP (%mo>>16)
			x86::Gp c = emit_get_cmem(cc, dev, o, d.cmode, param);
			cc.movsxd(lhs, c);
			rhs = emit_macc_output(cc, dev, o, 'o', d.sfmo, d.movm, d.rnd);
			cc.sar(rhs, Imm(16));
		} else {
			ok = false;
		}
		if (!ok)
			return false;
		if (is_add) cc.add(lhs, rhs); else cc.sub(lhs, rhs);
		emit_wa(cc, dev, o, lhs);
		return true;
	}

	// ---- macc shift ops: sfml / sfmr -------------------------------------------------------
	if (is("sfml") || is("sfmr")) {
		// macc = (macc & 0x8000000000000) | ((macc <</>> 1) & 0x7ffffffffffff)
		x86::Gp m = cc.new_gpz(), hi = cc.new_gpz(), mask = cc.new_gpz();
		cc.mov(m, x86::qword_ptr(dev, o.macc));
		cc.mov(hi, m);
		cc.mov(mask, Imm(0x8000000000000LL));
		cc.and_(hi, mask);
		if (is("sfml")) cc.shl(m, Imm(1)); else cc.shr(m, Imm(1));
		cc.mov(mask, Imm(0x7ffffffffffffLL));
		cc.and_(m, mask);
		cc.or_(m, hi);
		cc.mov(x86::qword_ptr(dev, o.macc), m);
		return true;
	}

	// ---- macc loads: lmhc / lmhd / lmld ----------------------------------------------------
	if (is("lmhc")) {   // macc = macc_write = ((int64)(int32)%c) << 16
		x86::Gp c = emit_get_cmem(cc, dev, o, d.cmode, param);
		x86::Gp m = cc.new_gpz();
		cc.movsxd(m, c);
		cc.shl(m, Imm(16));
		cc.mov(x86::qword_ptr(dev, o.macc), m);
		cc.mov(x86::qword_ptr(dev, o.macc_w), m);
		return true;
	}
	if (is("lmhd")) {   // macc = macc_write = ((int64)(int32)(%d)) << 16  [lmhd_d_operand = %d, forward off]
		if (dsp.jit_lmhd_forward_on())
			return false;
		x86::Gp v = emit_load_d(cc, dev, o, d.dmode, d.dbp, param);
		x86::Gp m = cc.new_gpz();
		cc.movsxd(m, v);
		cc.shl(m, Imm(16));
		cc.mov(x86::qword_ptr(dev, o.macc), m);
		cc.mov(x86::qword_ptr(dev, o.macc_w), m);
		return true;
	}
	if (is("lmld")) {   // macc = macc_write = (macc & ~0xffffff) | %d24
		x86::Gp v = emit_load_d24(cc, dev, o, d.dmode, d.dbp, param);
		x86::Gp m = cc.new_gpz(), mask = cc.new_gpz();
		cc.mov(m, x86::qword_ptr(dev, o.macc));
		cc.mov(mask, Imm(~0xffffffLL));
		cc.and_(m, mask);
		x86::Gp v64 = cc.new_gpz();
		cc.mov(v64.r32(), v);     // zero-extend %d24
		cc.or_(m, v64);
		cc.mov(x86::qword_ptr(dev, o.macc), m);
		cc.mov(x86::qword_ptr(dev, o.macc_w), m);
		return true;
	}

