joelanders/mame-profligacy/src/devices/cpu/tms57002/jit/tms57002_ops.cpp
	// ---- mac / macs / macu / mpy / mpyu (sfma=0, forward off) -------------------------------
	if (is("mac") || is("macs") || is("macu") || is("mpy") || is("mpyu")) {
		if (d.sfma != 0)
			return false;   // %ml pre-shift (macc<<2 / <<4 / >>16) not yet emitted
		if (dsp.jit_mpy_forward_on())
			return false;   // debug forward mode -> deopt
		// c-source (0=cmem(cmode) 1=aacc 2=creg), d-source (0=dmem signed 1=dmem unsigned 2=aacc),
		// shift, accumulate, creg-write — keyed by (mnemonic, .lst id).
		int csrc, dsrc, shift;
		bool acc, cwrite;
		const unsigned id = d.id;
		if (is("mac")) {
			acc = true; cwrite = true;
			if (id == 0x24) { csrc = 0; dsrc = 0; shift = 7; }
			else if (id == 0x25) { csrc = 1; dsrc = 0; shift = 7; }
			else if (id == 0x26) { csrc = 0; dsrc = 2; shift = 15; }
			else return false;
		} else if (is("macs")) {
			acc = true; cwrite = true; csrc = 0; dsrc = 2; shift = 14;
			if (id != 0x2e) return false;
		} else if (is("macu")) {
			acc = true; cwrite = true; shift = 7;
			if (id == 0x29) { csrc = 0; dsrc = 1; }
			else if (id == 0x2a) { csrc = 1; dsrc = 1; }
			else return false;
		} else if (is("mpy")) {
			acc = false;
			if (id == 0x21) { csrc = 0; dsrc = 0; shift = 7; cwrite = true; }
			else if (id == 0x22) { csrc = 0; dsrc = 2; shift = 15; cwrite = true; }
			else if (id == 0x23) { csrc = 2; dsrc = 0; shift = 7; cwrite = false; }
			else return false;
		} else {  // mpyu
			acc = false; cwrite = true; shift = 7;
			if (id == 0x28) { csrc = 0; dsrc = 1; }
			else return false;
		}

		// The multiplier's A input is 24 bits. It receives %a only in the c,a forms (dsrc==2);
		// a,d routes %a to the full-width C input (csrc==1).
		auto mask_a = [&](x86::Gp v32) { cc.and_(v32, Imm(0xffffff00U)); };
		// c (32-bit) + optional creg write. csrc==1 receives the full %a view, including sfao<<7.
		x86::Gp c = cc.new_gp32();
		if (csrc == 0) c = emit_get_cmem(cc, dev, o, d.cmode, param);
		else if (csrc == 1) c = emit_load_a(cc, dev, o, d.sfao);
		else cc.mov(c, x86::dword_ptr(dev, o.creg));
		if (cwrite) cc.mov(x86::dword_ptr(dev, o.creg), c);

		// r = (int64)(int32)c * (int64)d   (d: signed dmem / unsigned dmem / signed %a)
		x86::Gp rc = cc.new_gpz(), rd = cc.new_gpz();
		cc.movsxd(rc, c);
		if (dsrc == 2) {
			x86::Gp av = emit_load_a(cc, dev, o, d.sfao);   // %a: sfao<<7 before the (int32) cast
			mask_a(av);                                     // ...then the 24-bit A-port truncation
			cc.movsxd(rd, av);
		} else {
			x86::Gp dv = emit_load_d24(cc, dev, o, d.dmode, d.dbp, param);
			if (dsrc == 0) {                 // signed: sign-extend bit23
				cc.shl(dv, Imm(8));
				cc.sar(dv, Imm(8));
				cc.movsxd(rd, dv);
			} else {                         // unsigned 24-bit
				cc.mov(rd.r32(), dv);        // zero-extend
			}
		}
		cc.imul(rc, rd);
		cc.sar(rc, Imm(shift));
		if (acc) {
			x86::Gp m = cc.new_gpz();
			cc.mov(m, x86::qword_ptr(dev, o.macc));
			cc.add(m, rc);
			cc.mov(x86::qword_ptr(dev, o.macc), m);
		} else {
			cc.mov(x86::qword_ptr(dev, o.macc), rc);
		}
		return true;
	}

	// ---- dmem writes: sacd / srbd (non-%mo) ------------------------------------------------
	if (is("sacd")) {   // %wd(%a >> 8)
		x86::Gp a = emit_load_a(cc, dev, o, d.sfao);
		cc.shr(a, Imm(8));
		emit_write_dmem(cc, dev, o, d.dmode, d.dbp, param, a);
		return true;
	}
	if (is("srbd")) {   // %wd(xrd)
		x86::Gp v = cc.new_gp32();
		cc.mov(v, x86::dword_ptr(dev, o.xrd));
		emit_write_dmem(cc, dev, o, d.dmode, d.dbp, param, v);
		return true;
	}

	// ---- macc-output dmem writes: smhd / smld / slmh / slml (%mo/%mn/%mv) -------------------
	if (is("smhd")) {   // %wd(((raw?%mv:%mo) >> 24) & 0xffffff)
		x86::Gp mo = emit_macc_output(cc, dev, o, dsp.jit_smhd_raw_path() ? 'v' : 'o', d.sfmo, d.movm, d.rnd);
		cc.sar(mo, Imm(24));
		emit_write_dmem(cc, dev, o, d.dmode, d.dbp, param, mo.r32());
		return true;
	}
	if (is("smld")) {   // %wd(%mv & 0xffffff) — raw MACC[23:0], independent of output mode
		// Silicon writes the raw low 24 bits. No shift or SFMO/MOVM/RND transform applies.
		x86::Gp mo = emit_macc_output(cc, dev, o, 'v', d.sfmo, d.movm, d.rnd);
		emit_write_dmem(cc, dev, o, d.dmode, d.dbp, param, mo.r32());
		return true;
	}
	if (is("slmh")) {   // %wd((%mv >> 24) & 0xffff00)
		x86::Gp mo = emit_macc_output(cc, dev, o, 'v', d.sfmo, d.movm, d.rnd);
		cc.sar(mo, Imm(24));
		cc.and_(mo, Imm(0xffff00));
		emit_write_dmem(cc, dev, o, d.dmode, d.dbp, param, mo.r32());
		return true;
	}
	if (is("slml")) {   // %wd((%mv >> 8) & 0xffffff)
		x86::Gp mo = emit_macc_output(cc, dev, o, 'v', d.sfmo, d.movm, d.rnd);
		cc.sar(mo, Imm(8));
		emit_write_dmem(cc, dev, o, d.dmode, d.dbp, param, mo.r32());
		return true;
	}

	// ---- cmem writes: sacc (%a) / smhc (%mo) -----------------------------------------------
	if (is("sacc") || is("smhc")) {
		x86::Gp v;
		if (is("sacc")) {                                 // %wc(%a)
			v = emit_load_a(cc, dev, o, d.sfao);
		} else {                                          // smhc: %wc(smhc_store_shift(%mo)) = (%mo>>16) & ~((1<<tb)-1)
			x86::Gp mo = emit_macc_output(cc, dev, o, 'o', d.sfmo, d.movm, d.rnd);
			cc.sar(mo, Imm(16));
			v = cc.new_gp32();
			cc.mov(v, mo.r32());
			if (const int tb = dsp.jit_smhc_trunc_bits())   // fork silicon fix (parity with pooled): high-bits-only store
				cc.and_(v, Imm(u32(~((1u << tb) - 1))));
		}
		if (d.cmode) {
			x86::Gp caddr = cc.new_gpz();
			cc.movzx(caddr, x86::byte_ptr(dev, o.ca));
			cc.mov(x86::dword_ptr(dev, caddr, 2, o.cmem), v);
		} else {
			cc.mov(x86::dword_ptr(dev, o.cmem + int(param) * 4), v);
		}
		return true;
	}

	// ---- XRAM arm: rde / wre ---------------------------------------------------------------
	if (is("rde") || is("wre")) {
		// if (sti & (S_READ|S_WRITE)) return;  [wre: xwr = %d24;]  xoa = %c;  xm_init();  sti |= flag;
		const u32 rw = tms57002_device::jit_s_read_mask() | tms57002_device::jit_s_write_mask();
		const u32 flag = is("wre") ? tms57002_device::jit_s_write_mask() : tms57002_device::jit_s_read_mask();
		Label done = cc.new_label();
		{ x86::Gp s = cc.new_gp32(); cc.mov(s, x86::dword_ptr(dev, o.sti)); cc.test(s, Imm(rw)); cc.jnz(done); }
		if (is("wre")) {
			x86::Gp xw = emit_load_d24(cc, dev, o, d.dmode, d.dbp, param);
			cc.mov(x86::dword_ptr(dev, o.xwr), xw);
		}
		x86::Gp c = emit_get_cmem(cc, dev, o, d.cmode, param);
		cc.mov(x86::dword_ptr(dev, o.xoa), c);
		{ InvokeNode *xi = nullptr; cc.invoke(Out(xi), uint64_t(&ops_xm_init), FuncSignature::build<void, tms57002_device *>()); xi->set_arg(0, dev); }
		cc.or_(x86::dword_ptr(dev, o.sti), Imm(flag));
		cc.bind(done);
		return true;
	}

	// ---- serial output writes: dos / domh (render path only; deopt under the serial cycle model) --
	// serial_output_write(n, v) == so[n] = v & 0xffffff  when !serial_cycle_model_enabled(). The op's
	// output lane n is baked in the opcode id (dos 0x1c..0x1f, domh 0x20..0x23 -> n = id & 3).
	if (is("dos") || is("domh")) {
		if (dsp.jit_serial_model())
			return false;   // cycle model on -> intricate phase advance -> deopt to the interpreter
		const int n = int(d.id & 3);
		x86::Gp v;
		if (is("dos")) {                                  // serial_output_write(n, %d24)
			v = emit_load_d24(cc, dev, o, d.dmode, d.dbp, param);
		} else {                                          // domh: serial_output_write(n, (%mo>>24)&0xffffff)
			x86::Gp mo = emit_macc_output(cc, dev, o, 'o', d.sfmo, d.movm, d.rnd);
			cc.sar(mo, Imm(24));
			v = cc.new_gp32();
			cc.mov(v, mo.r32());
		}
		cc.and_(v, Imm(0xffffff));
		cc.mov(x86::dword_ptr(dev, o.so + n * 4), v);
		return true;
	}

