joelanders/mame-profligacy/src/devices/cpu/tms57002/jit/tms57002_ops.cpp
	return false;   // not yet natively emitted — the gate skips it, the dynarec deopts it
}

// ===== Milestone 2: pooled (register-resident) op bodies =========================================
// Same semantics as emit_op_mem, but macc/aacc live in PINNED registers (r.macc/r.aacc) and the
// per-instruction operand comes from r.param — so ONE body serves every PC of an op-id. Preconditions
// (jit_pooled_safe): no pending cmem update etc., so a cmem read is a direct cmem[addr] (NO C-calls).

void emit_op_pooled(x86::Assembler &a, const PoolRegs &r, tms57002_device &dsp, unsigned op, std::uint64_t icd_addr) {
	const Off o;
	const tms57002_opdesc_t &d = tms57002_op_desc[op];
	const char *mn = d.mn;
	auto is = [&](const char *s) { return std::strcmp(mn, s) == 0; };
	// caller-saved scratch (no C-calls in these bodies, so all are freely clobberable):
	const x86::Gp T0 = x86::rax, T1 = x86::rcx, T2 = x86::rdx, T3 = x86::r8, T4 = x86::r9, T5 = x86::r10;

	// element index (param|id + ba{dbp}) & mask{dbp} -> idx (64); clobbers tmp (64).
	auto dmem_index = [&](x86::Gp idx, x86::Gp tmp) {
		a.movzx(idx, x86::byte_ptr(r.dev, d.dbp ? o.ba1 : o.ba0));
		if (d.dmode) { a.movzx(tmp, x86::byte_ptr(r.dev, o.id)); a.add(idx, tmp); }
		else a.add(idx, r.param);
		a.and_(idx, Imm(d.dbp ? 0x1f : 0xff));
	};
	// %d24 = dmem{dbp}[idx] -> dst32 ; clobbers idx(64)+tmp(64).
	auto load_d24 = [&](x86::Gp dst32, x86::Gp idx, x86::Gp tmp) {
		dmem_index(idx, tmp);
		a.mov(dst32, x86::dword_ptr(r.dev, idx, 2, d.dbp ? o.dmem1 : o.dmem0));
	};
	// %c = get_cmem(cmode) [direct] -> dst32 ; clobbers tmp(64) for the ca form.
	auto cmem_into = [&](x86::Gp dst32, x86::Gp tmp) {
		if (d.cmode) { a.movzx(tmp, x86::byte_ptr(r.dev, o.ca)); a.mov(dst32, x86::dword_ptr(r.dev, tmp, 2, o.cmem)); }
		else a.mov(dst32, x86::dword_ptr(r.dev, r.param, 2, o.cmem));
		// CRM (coefficient-RAM mode) view — match current_cmem_view(): crm==1 -> &0xffff0000, crm==2 -> <<16,
		// crm==0/3 -> raw. scrm can change the mode mid-frame so read st1 at runtime. crm==0 is the common
		// case and the `and` already set ZF for it -> one taken jz and done (the cmp/je pair only runs for
		// crm!=0). Reads (%c) go through here; cmem WRITES stay raw (crm is a read view).
		a.mov(tmp.r32(), x86::dword_ptr(r.dev, o.st1));
		a.and_(tmp.r32(), Imm(tms57002_device::jit_st1_crm()));
		Label crm_16h = a.new_label(), crm_16l = a.new_label(), crm_done = a.new_label();
		a.jz(crm_done);   // crm==0 -> raw view (common case, fused with the `and`'s ZF)
		a.cmp(tmp.r32(), Imm(tms57002_device::jit_st1_crm_16h())); a.je(crm_16h);
		a.cmp(tmp.r32(), Imm(tms57002_device::jit_st1_crm_16l())); a.je(crm_16l);
		a.jmp(crm_done);   // crm==3 -> raw
		a.bind(crm_16h); a.and_(dst32, Imm(0xffff0000u)); a.jmp(crm_done);
		a.bind(crm_16l); a.shl(dst32, Imm(16));
		a.bind(crm_done);
	};
	// %a = aacc (<<7 if sfao) -> dst32.
	auto load_a = [&](x86::Gp dst32) { a.mov(dst32, r.aacc.r32()); if (d.sfao) a.shl(dst32, Imm(7)); };
	// %wa(rr64) -> aacc(pinned): int32-overflow -> ST1_AOV; AOVM -> clamp. clobbers s1,s2 (64).
	auto wa = [&](x86::Gp rr, x86::Gp s1, x86::Gp s2) {
		a.movsxd(s1, rr.r32()); a.cmp(s1, rr);
		Label noovf = a.new_label();
		a.je(noovf);
		a.or_(x86::dword_ptr(r.dev, o.st1), Imm(tms57002_device::jit_st1_aov()));
		Label noclamp = a.new_label();
		a.test(x86::dword_ptr(r.dev, o.st1), Imm(tms57002_device::jit_st1_aovm()));
		a.jz(noclamp);
		a.mov(s1, Imm(2147483647LL)); a.cmp(rr, s1); a.cmovg(rr, s1);
		a.mov(s2, Imm(-2147483648LL)); a.cmp(rr, s2); a.cmovl(rr, s2);
		a.bind(noclamp); a.bind(noovf);
		a.mov(r.aacc.r32(), rr.r32());
	};

	// %mo/%mn/%mv (macc_to_output_{sfmo}[s|n] / check_macc_overflow_{sfmo}[s]) -> result in T0 (s64).
	// Reads macc_read (pinned r.macc_r). Sets ST1_MOV and (movm) clamps on overflow. kind: 'o'/'n'/'v'.
	// Uses T0=result, T1=mr, T2=ov, T3/T4 scratch. All constants compile-time from (sfmo,movm,rnd).
	auto macc_output = [&](char kind, unsigned sfmo, unsigned movm, unsigned rnd) {
		static const u64 PRE_MASK[4] = { 0xf800000000000ULL, 0xfe00000000000ULL, 0xff80000000000ULL, 0ULL };
		static const long long ROUNDING[5] = { 0, 0x8000, 0x800000, 0x8000000, 0x80000000LL };   // [3]=1<<27 (fork RND-mode3 fix, 48-20; was 0x20000=48-30)
		static const u64 RMASK[5] = { 0xffffffffffffffffULL, 0xffffffffffff0000ULL, 0xffffffffff000000ULL, 0xfffffffff0000000ULL, 0xffffffff00000000ULL };   // [3] low 28 zeroed (48-20 fix)
		static const long long CLIP_POS[5] = { 0x00007fffffffffffLL, 0x00007fffffff0000LL, 0x00007fffff000000LL, 0x00007ffff0000000LL, 0x00007fff00000000LL };
		static const long long CLIP_NEG[5] = { (long long)0xffff800000000000ULL, (long long)0xffff800000000000ULL, (long long)0xffff800000000000ULL, (long long)0xffff800000000000ULL, (long long)0xffff800000000000ULL };
		const long long FIX_POS = 0x00007fffffffffffLL, FIX_NEG = (long long)0xffff800000000000ULL;
		const u64 POST_MASK = 0xf800000000000ULL;
		if (rnd > 4) rnd = 4;
		a.mov(T1, r.macc_r);   // mr (for the sign test)
		a.mov(T0, T1);         // m = macc_read
		a.xor_(T2, T2);        // ov = 0
		auto ovcheck = [&](u64 mask) {
			a.mov(T3, T0); a.mov(T4, Imm((long long)mask)); a.and_(T3, T4);
			Label no = a.new_label(); a.jz(no); a.cmp(T3, T4); a.je(no); a.mov(T2, Imm(1)); a.bind(no);
		};
		auto clamp = [&](bool table) {
			a.or_(x86::dword_ptr(r.dev, o.st1), Imm(tms57002_device::jit_st1_mov()));
			if (movm) {
				a.mov(T3, T1); a.mov(T4, Imm((long long)0x8000000000000ULL)); a.and_(T3, T4);   // neg = mr & topbit
				a.mov(T0, Imm(table ? CLIP_POS[rnd] : FIX_POS));
				a.mov(T4, Imm(table ? CLIP_NEG[rnd] : FIX_NEG));
				a.test(T3, T3); a.cmovnz(T0, T4);
			}
		};
		if (kind == 'v') {
			if (sfmo != 3) { ovcheck(PRE_MASK[sfmo]); Label noov = a.new_label(); a.test(T2, T2); a.jz(noov); clamp(false); a.bind(noov); }
			return;   // result in T0
		}
		if (sfmo != 3) ovcheck(PRE_MASK[sfmo]);
		if (sfmo == 1) a.shl(T0, Imm(2)); else if (sfmo == 2) a.shl(T0, Imm(4)); else if (sfmo == 3) a.sar(T0, Imm(8));
		if (ROUNDING[rnd]) { a.mov(T3, Imm(ROUNDING[rnd])); a.add(T0, T3); }
		a.mov(T3, Imm((long long)RMASK[rnd])); a.and_(T0, T3);
		ovcheck(POST_MASK);
		Label noov = a.new_label(); a.test(T2, T2); a.jz(noov); clamp(kind == 'o'); a.bind(noov);
		// result in T0
	};

	// ---- flag-setters: st1 = (st1 & keep) | set (probe the oracle) -------------------------------
	if (d.type == 'f') {
		const void *icd = reinterpret_cast<const void *>(icd_addr);
		const u32 v0 = dsp.jit_probe_st1(op, icd, 0x00000000u);
		const u32 vF = dsp.jit_probe_st1(op, icd, 0xffffffffu);
		const u32 setb = v0, keep = vF & ~setb;
		if (keep != 0xffffffffu) a.and_(x86::dword_ptr(r.dev, o.st1), Imm(keep));
		if (setb != 0u) a.or_(x86::dword_ptr(r.dev, o.st1), Imm(setb));
		return;
	}
	// ---- trivial ----
	if (is("zmac")) { a.xor_(r.macc, r.macc); return; }
	if (is("zacc")) { a.xor_(r.aacc.r32(), r.aacc.r32()); return; }
	if (is("raov")) { a.and_(x86::dword_ptr(r.dev, o.st1), Imm(~tms57002_device::jit_st1_aov())); return; }
	if (is("rmov")) { a.and_(x86::dword_ptr(r.dev, o.st1), Imm(~tms57002_device::jit_st1_mov())); return; }
	if (is("lcak")) { a.mov(x86::byte_ptr(r.dev, o.ca), r.param.r8()); return; }
	if (is("lirk")) { a.mov(x86::byte_ptr(r.dev, o.id), r.param.r8()); return; }
	if (is("idle")) { a.or_(x86::dword_ptr(r.dev, o.sti), Imm(tms57002_device::jit_s_idle_mask())); return; }
	if (is("lira")) { load_a(T0.r32()); a.shr(T0.r32(), Imm(24)); a.mov(x86::byte_ptr(r.dev, o.id), T0.r8()); return; }
	if (is("lcaa")) { load_a(T0.r32()); a.shr(T0.r32(), Imm(24)); a.mov(x86::byte_ptr(r.dev, o.ca), T0.r8()); return; }
	// ---- macc shift: sfml/sfmr ----
	if (is("sfml") || is("sfmr")) {
		a.mov(T0, r.macc); a.mov(T1, Imm(0x8000000000000LL)); a.and_(T0, T1);   // hi = macc & topbit
		if (is("sfml")) a.shl(r.macc, Imm(1)); else a.shr(r.macc, Imm(1));
		a.mov(T1, Imm(0x7ffffffffffffLL)); a.and_(r.macc, T1);
		a.or_(r.macc, T0);
		return;
	}
	// ---- loads ----
	if (is("lacc")) { cmem_into(T0.r32(), T1); a.mov(r.aacc.r32(), T0.r32()); return; }
	if (is("lacd")) { load_d24(T0.r32(), T1, T2); a.shl(T0.r32(), Imm(8)); if (d.sfai) a.sar(T0.r32(), Imm(1)); a.mov(r.aacc.r32(), T0.r32()); return; }
	// ---- logic: and/or/xor (aacc is pinned -> operate on the register) ----
	if (is("and") || is("or") || is("xor")) {
		const unsigned base = is("and") ? 0x14 : is("or") ? 0x17 : 0x1a;
		const unsigned form = d.id - base;   // 0=%d,a 1=%c,a 2=%d,%c
		auto ap = [&](const x86::Gp &dst, const x86::Gp &src) { if (is("and")) a.and_(dst, src); else if (is("or")) a.or_(dst, src); else a.xor_(dst, src); };
		if (form == 1) {                                   // %c,a : aacc OP= %c
			cmem_into(T0.r32(), T1);
			ap(r.aacc.r32(), T0.r32());
		} else {
			load_d24(T0.r32(), T1, T2); a.shl(T0.r32(), Imm(8)); if (d.sfai) a.sar(T0.r32(), Imm(1));   // %sfai(d,%d)
			if (form == 0) {                               // %d,a : aacc OP= d
				ap(r.aacc.r32(), T0.r32());
			} else {                                       // %d,%c : aacc = %c OP d
				cmem_into(T1.r32(), T3);
				ap(T1.r32(), T0.r32());
				a.mov(r.aacc.r32(), T1.r32());
			}
		}
		return;
	}
	// ---- %wa arith: neg/abs/add/sub ----
	if (is("neg")) { load_a(T0.r32()); a.movsxd(T1, T0.r32()); a.neg(T1); wa(T1, T2, T3); return; }
	if (is("abs")) {
		// .lst: `aacc = %a;` FIRST (unconditionally) — under sfao=1 aacc becomes aacc<<7 even when
		// positive. The 2026-07-05 audit fixed this body reading aacc raw (missed the sfao view).
		load_a(T0.r32());
		a.mov(r.aacc.r32(), T0.r32());
		Label done = a.new_label();
		a.test(T0.r32(), T0.r32()); a.jns(done);
		a.neg(T0.r32()); a.mov(r.aacc.r32(), T0.r32());
		a.test(T0.r32(), T0.r32()); a.jns(done);
		a.or_(x86::dword_ptr(r.dev, o.st1), Imm(tms57002_device::jit_st1_aov()));
		if (dsp.jit_abs_saturate())
			a.mov(r.aacc.r32(), Imm(0x7fffffffu));
		else {
			Label no_clamp = a.new_label();
			a.test(x86::dword_ptr(r.dev, o.st1), Imm(tms57002_device::jit_st1_aovm()));
			a.jz(no_clamp);
			a.mov(r.aacc.r32(), Imm(0x7fffffffu));
			a.bind(no_clamp);
		}
		a.bind(done);
		return;
	}
	if (is("add") || is("sub")) {
		const unsigned lo = d.id & 0xf;
		const bool is_add = is("add");
		const bool mo_form = (lo == 0x05 || lo == 0x06 || lo == 0x0b || lo == 0x0c);
		if (!mo_form) {   // (int32)X OP (int32)Y -> %wa
			if ((is_add && lo == 0x03) || (!is_add && lo == 0x09)) { load_d24(T0.r32(), T1, T2); a.shl(T0.r32(), Imm(8)); a.movsxd(T1, T0.r32()); load_a(T0.r32()); a.movsxd(T2, T0.r32()); }
			else if ((is_add && lo == 0x04) || (!is_add && lo == 0x0a)) { cmem_into(T0.r32(), T3); a.movsxd(T1, T0.r32()); load_a(T0.r32()); a.movsxd(T2, T0.r32()); }
			else /* 0x07 / 0x0d */ { load_d24(T0.r32(), T1, T2); a.shl(T0.r32(), Imm(8)); a.movsxd(T1, T0.r32()); cmem_into(T0.r32(), T3); a.movsxd(T2, T0.r32()); }
			if (is_add) a.add(T1, T2); else a.sub(T1, T2);
			wa(T1, T3, T4);
		} else {          // %d/%c , m : lhs(int32) OP (%mo>>16) -> %wa   (lhs kept in T5 across macc_output)
			const bool d_form = (lo == 0x05 || lo == 0x0b);
			if (d_form) { load_d24(T0.r32(), T1, T2); a.shl(T0.r32(), Imm(8)); if (d.sfai) a.sar(T0.r32(), Imm(1)); a.movsxd(T5, T0.r32()); }
			else { cmem_into(T0.r32(), T1); a.movsxd(T5, T0.r32()); }
			macc_output('o', d.sfmo, d.movm, d.rnd);   // -> T0
			a.sar(T0, Imm(16));
			if (is_add) a.add(T5, T0); else a.sub(T5, T0);
			wa(T5, T1, T2);
		}
		return;
	}
	// ---- mac / macs / macu / mpy / mpyu (sfma=0; cmem direct; forward modes excluded by the frame) ----
	if (is("mac") || is("macs") || is("macu") || is("mpy") || is("mpyu")) {
		int csrc, dsrc, shift; bool acc, cwrite;
		const unsigned id = d.id;
		if (is("mac")) { acc = true; cwrite = true;
			if (id == 0x24) { csrc = 0; dsrc = 0; shift = 7; } else if (id == 0x25) { csrc = 1; dsrc = 0; shift = 7; } else { csrc = 0; dsrc = 2; shift = 15; } }
		else if (is("macs")) { acc = true; cwrite = true; csrc = 0; dsrc = 2; shift = 14; }
		else if (is("macu")) { acc = true; cwrite = true; shift = 7; if (id == 0x29) { csrc = 0; dsrc = 1; } else { csrc = 1; dsrc = 1; } }
		else if (is("mpy")) { acc = false;
			if (id == 0x21) { csrc = 0; dsrc = 0; shift = 7; cwrite = true; } else if (id == 0x22) { csrc = 0; dsrc = 2; shift = 15; cwrite = true; } else { csrc = 2; dsrc = 0; shift = 7; cwrite = false; } }
		else { acc = false; cwrite = true; csrc = 0; dsrc = 1; shift = 7; }   // mpyu 0x28
		// The multiplier's A input is 24 bits. It receives %a only in the c,a forms (dsrc==2);
		// a,d routes %a to the full-width C input (csrc==1).
		auto mask_a = [&](x86::Gp v32) { a.and_(v32, Imm(0xffffff00U)); };
		// c (T0.r32) + optional creg write. csrc==1 receives the full %a view, including sfao<<7.
		if (csrc == 0) cmem_into(T0.r32(), T1);
		else if (csrc == 1) load_a(T0.r32());
		else a.mov(T0.r32(), x86::dword_ptr(r.dev, o.creg));
		if (cwrite) a.mov(x86::dword_ptr(r.dev, o.creg), T0.r32());
		// r = (int64)(int32)c * (int64)d  -> T2 * T3
		a.movsxd(T2, T0.r32());
		if (dsrc == 2) {
			load_a(T4.r32());          // d-side %a: sfao<<7 applies before the (int32) cast
			mask_a(T4.r32());          // ...then the 24-bit A-port truncation, before the cast
			a.movsxd(T3, T4.r32());
		} else {
			load_d24(T4.r32(), T1, T5);
			if (dsrc == 0) { a.shl(T4.r32(), Imm(8)); a.sar(T4.r32(), Imm(8)); a.movsxd(T3, T4.r32()); }   // signed 24
			else a.mov(T3.r32(), T4.r32());                                                                 // unsigned 24 (zero-ext)
		}
		a.imul(T2, T3);
		a.sar(T2, Imm(shift));
		if (acc) a.add(r.macc, T2); else a.mov(r.macc, T2);
		return;
	}
	// ---- macc loads: lmhc / lmhd / lmld (write macc AND macc_write pinned) ----
	if (is("lmhc")) { cmem_into(T0.r32(), T1); a.movsxd(T2, T0.r32()); a.shl(T2, Imm(16)); a.mov(r.macc, T2); a.mov(r.macc_w, T2); return; }
	if (is("lmhd")) { load_d24(T0.r32(), T1, T2); a.shl(T0.r32(), Imm(8)); a.movsxd(T2, T0.r32()); a.shl(T2, Imm(16)); a.mov(r.macc, T2); a.mov(r.macc_w, T2); return; }
	if (is("lmld")) { load_d24(T0.r32(), T1, T2); a.mov(T1, r.macc); a.mov(T2, Imm((long long)~0xffffffLL)); a.and_(T1, T2); a.mov(T3.r32(), T0.r32()); a.or_(T1, T3); a.mov(r.macc, T1); a.mov(r.macc_w, T1); return; }
	// ---- macc-output writes: smhc (%wc) / smhd,smld,slmh,slml (%wd), reading macc_read via %mo/%mn/%mv ----
	if (is("smhc")) {
		macc_output('o', d.sfmo, d.movm, d.rnd);
		a.sar(T0, Imm(16));
		if (const int tb = dsp.jit_smhc_trunc_bits())   // fork silicon fix: smhc stores only the high (32-tb) bits
			a.and_(T0.r32(), Imm(u32(~((1u << tb) - 1))));
		if (d.cmode) { a.movzx(T1, x86::byte_ptr(r.dev, o.ca)); a.mov(x86::dword_ptr(r.dev, T1, 2, o.cmem), T0.r32()); }
		else a.mov(x86::dword_ptr(r.dev, r.param, 2, o.cmem), T0.r32());
		return;
	}
	if (is("smhd") || is("smld") || is("slmh") || is("slml")) {
		char kind; int sh; unsigned mask;
		if (is("smhd")) { kind = dsp.jit_smhd_raw_path() ? 'v' : 'o'; sh = 24; mask = 0xffffff; }
		// SMLD stores raw MACC[23:0]; it is independent of SFMO/MOVM/RND.
		else if (is("smld")) { kind = 'v'; sh = 0; mask = 0xffffff; }
		else if (is("slmh")) { kind = 'v'; sh = 24; mask = 0xffff00; }
		else { kind = 'v'; sh = 8; mask = 0xffffff; }   // slml
		macc_output(kind, d.sfmo, d.movm, d.rnd);
		if (sh)
			a.sar(T0, Imm(sh));
		a.and_(T0.r32(), Imm(mask));
		dmem_index(T1, T2);
		a.mov(x86::dword_ptr(r.dev, T1, 2, d.dbp ? o.dmem1 : o.dmem0), T0.r32());
		return;
	}
	// ---- writes ----
	if (is("sacc")) {
		load_a(T0.r32());
		if (d.cmode) { a.movzx(T1, x86::byte_ptr(r.dev, o.ca)); a.mov(x86::dword_ptr(r.dev, T1, 2, o.cmem), T0.r32()); }
		else a.mov(x86::dword_ptr(r.dev, r.param, 2, o.cmem), T0.r32());
		return;
	}
	if (is("sacd")) { load_a(T0.r32()); a.shr(T0.r32(), Imm(8)); a.and_(T0.r32(), Imm(0xffffff)); dmem_index(T1, T2); a.mov(x86::dword_ptr(r.dev, T1, 2, d.dbp ? o.dmem1 : o.dmem0), T0.r32()); return; }
	if (is("srbd")) { a.mov(T0.r32(), x86::dword_ptr(r.dev, o.xrd)); a.and_(T0.r32(), Imm(0xffffff)); dmem_index(T1, T2); a.mov(x86::dword_ptr(r.dev, T1, 2, d.dbp ? o.dmem1 : o.dmem0), T0.r32()); return; }
	// ---- XRAM arm: rde / wre (.lst: early-out if a transaction is in flight; wre stores %d24 to xwr;
	// xoa = %c; xm_init(); sti |= S_READ/S_WRITE). Same order as emit_op_mem (audited). xm_init is the
	// ONE pool-body C call: a body is entered via `call` from the driver (rsp ≡ 8 mod 16 here), so the
	// call site is realigned with sub/add rsp,8. xm_init touches only xm_adr/txrd/xm_fetches/xm_cycles
	// (no macc/aacc/pc), caller-saved scratch (incl. r11) is dead at that point, pinned regs survive.
	if (is("rde") || is("wre")) {
		const u32 rw = tms57002_device::jit_s_read_mask() | tms57002_device::jit_s_write_mask();
		const u32 flag = is("wre") ? tms57002_device::jit_s_write_mask() : tms57002_device::jit_s_read_mask();
		Label armed = a.new_label();
		a.mov(T0.r32(), x86::dword_ptr(r.dev, o.sti));
		a.test(T0.r32(), Imm(rw));
		a.jnz(armed);   // transaction in flight -> the op is a no-op
		if (is("wre")) { load_d24(T0.r32(), T1, T2); a.mov(x86::dword_ptr(r.dev, o.xwr), T0.r32()); }
		cmem_into(T0.r32(), T1);
		a.mov(x86::dword_ptr(r.dev, o.xoa), T0.r32());
		// The pooled body is entered through an internal call, so RSP is eight
		// bytes off call-site alignment here. Windows also needs 32 bytes of
		// shadow space for the C++ helper.
#if defined(_WIN32)
		a.mov(x86::rcx, r.dev);
		a.sub(x86::rsp, Imm(40));
#else
		a.mov(x86::rdi, r.dev);
		a.sub(x86::rsp, Imm(8));
#endif
		a.mov(x86::rax, Imm(uint64_t(&ops_xm_init)));
		a.call(x86::rax);
#if defined(_WIN32)
		a.add(x86::rsp, Imm(40));
#else
		a.add(x86::rsp, Imm(8));
#endif
		a.or_(x86::dword_ptr(r.dev, o.sti), Imm(flag));
		a.bind(armed);
		return;
	}
	// ---- serial output: dos (so[n]=%d24) / domh (so[n]=(%mo>>24)&0xffffff). n = opcode id & 3. ----
	if (is("dos")) { const int n = int(d.id & 3); load_d24(T0.r32(), T1, T2); a.and_(T0.r32(), Imm(0xffffff)); a.mov(x86::dword_ptr(r.dev, o.so + n * 4), T0.r32()); return; }
	if (is("domh")) { const int n = int(d.id & 3); macc_output('o', d.sfmo, d.movm, d.rnd); a.sar(T0, Imm(24)); a.and_(T0.r32(), Imm(0xffffff)); a.mov(x86::dword_ptr(r.dev, o.so + n * 4), T0.r32()); return; }
}

}  // namespace tms57002

#endif  // __x86_64__

// ===== aarch64 backend: pooled op bodies (2026-07-07 port) =======================================
// Same semantics as the x86 emit_op_pooled above, translated to a64 under the PoolRegs convention in
// tms57002_ops.h (DEV=x19, MACC=x20, MACR=x21, MACW=x22, AACC=x23/w23, PARAM=x15/w15; scratch
// x9-x14 = T0-T5, x8 = helper-internal). Translation rules applied throughout:
//  - x86 implicit-flag idioms (`and_`+`jz`, `test`+`jns/jnz`) become explicit `ands`/`cbz`/`tbz`.
//  - `cmov*` becomes `cmp`+`csel`.
//  - Computed masks/constants are materialized with `a.mov(reg, Imm)` (asmjit synthesizes up to 4
//    insns) + register-form ALU, never trusted to logical-immediate encodability.
//  - RMW on device fields (x86 `or_ [mem], imm`) becomes ldr/orr/str through scratch.
// Coverage is op_poolable above (shared). Bit-exactness arbiter: scripts/korgprophecy_pf4_gate.sh.
#if defined(__aarch64__)

