joelanders/mame-profligacy/src/devices/cpu/tms57002/jit/tms57002_ops.cpp
namespace tms57002 {

namespace {
using namespace asmjit;

// Device-field offsets used across the lowerings (same accessor set as the x86 backend).
struct OffA64 {
	int st1, sti, aacc, macc, macc_r, macc_w, cmem, creg, ca, id;
	int dmem0, dmem1, ba0, ba1, xoa, xwr, xrd, so;
	OffA64()
		: st1(int(tms57002_device::jit_off_st1()))
		, sti(int(tms57002_device::jit_off_sti()))
		, aacc(int(tms57002_device::jit_off_aacc()))
		, macc(int(tms57002_device::jit_off_macc()))
		, macc_r(int(tms57002_device::jit_off_macc_read()))
		, macc_w(int(tms57002_device::jit_off_macc_write()))
		, cmem(int(tms57002_device::jit_off_cmem()))
		, creg(int(tms57002_device::jit_off_creg()))
		, ca(int(tms57002_device::jit_off_ca()))
		, id(int(tms57002_device::jit_off_id()))
		, dmem0(int(tms57002_device::jit_off_dmem0()))
		, dmem1(int(tms57002_device::jit_off_dmem1()))
		, ba0(int(tms57002_device::jit_off_ba0()))
		, ba1(int(tms57002_device::jit_off_ba1()))
		, xoa(int(tms57002_device::jit_off_xoa()))
		, xwr(int(tms57002_device::jit_off_xwr()))
		, xrd(int(tms57002_device::jit_off_xrd()))
		, so(int(tms57002_device::jit_off_so()))
	{}
};

}  // namespace

void emit_op_pooled(a64::Assembler &a, const PoolRegs &r, tms57002_device &dsp, unsigned op, std::uint64_t icd_addr) {
	const OffA64 o;
	const tms57002_opdesc_t &d = tms57002_op_desc[op];
	const char *mn = d.mn;
	auto is = [&](const char *s) { return std::strcmp(mn, s) == 0; };
	// caller-saved scratch (no C-calls in these bodies, so all are freely clobberable):
	const a64::Gp T0 = a64::x9, T1 = a64::x10, T2 = a64::x11, T3 = a64::x12, T4 = a64::x13, T5 = a64::x14;
	const a64::Gp H = a64::x8;   // helper-internal (address materialization); never a value carrier

	// H = dev + off (address of a device array base). off is a compile-time struct offset.
	auto lea_dev = [&](int off) {
		if (off >= 0 && off <= 4095) a.add(H, r.dev, Imm(off));
		else { a.mov(H, Imm(off)); a.add(H, r.dev, H); }
	};
	// 32/64/8-bit device-field load/store. Direct [DEV, #off] when the scaled-imm12 form encodes;
	// otherwise via H. Never pass H/w8 as the value register.
	auto ld32 = [&](a64::Gp w, int off) {
		if (off >= 0 && off <= 16380 && !(off & 3)) a.ldr(w.w(), a64::ptr(r.dev, off));
		else { lea_dev(off); a.ldr(w.w(), a64::ptr(H)); }
	};
	auto st32 = [&](a64::Gp w, int off) {
		if (off >= 0 && off <= 16380 && !(off & 3)) a.str(w.w(), a64::ptr(r.dev, off));
		else { lea_dev(off); a.str(w.w(), a64::ptr(H)); }
	};
	auto ld64 = [&](a64::Gp x, int off) {
		if (off >= 0 && off <= 32760 && !(off & 7)) a.ldr(x.x(), a64::ptr(r.dev, off));
		else { lea_dev(off); a.ldr(x.x(), a64::ptr(H)); }
	};
	auto st64 = [&](a64::Gp x, int off) {
		if (off >= 0 && off <= 32760 && !(off & 7)) a.str(x.x(), a64::ptr(r.dev, off));
		else { lea_dev(off); a.str(x.x(), a64::ptr(H)); }
	};
	auto ldb = [&](a64::Gp w, int off) {
		if (off >= 0 && off <= 4095) a.ldrb(w.w(), a64::ptr(r.dev, off));
		else { lea_dev(off); a.ldrb(w.w(), a64::ptr(H)); }
	};
	auto stb = [&](a64::Gp w, int off) {
		if (off >= 0 && off <= 4095) a.strb(w.w(), a64::ptr(r.dev, off));
		else { lea_dev(off); a.strb(w.w(), a64::ptr(H)); }
	};
	// st1 |= bits / st1 = (st1 & keep) | set — RMW through s (value) + s2 (mask). Both clobbered.
	auto st1_rmw_or = [&](u32 bits, a64::Gp s, a64::Gp s2) {
		ld32(s, o.st1);
		a.mov(s2.w(), Imm(bits));
		a.orr(s.w(), s.w(), s2.w());
		st32(s, o.st1);
	};

	// element index (param|id + ba{dbp}) & mask{dbp} -> idx (64); clobbers tmp (64).
	auto dmem_index = [&](a64::Gp idx, a64::Gp tmp) {
		ldb(idx, d.dbp ? o.ba1 : o.ba0);
		if (d.dmode) { ldb(tmp, o.id); a.add(idx.x(), idx.x(), tmp.x()); }
		else a.add(idx.x(), idx.x(), r.param.x());
		a.and_(idx.x(), idx.x(), Imm(d.dbp ? 0x1f : 0xff));
	};
	// %d24 = dmem{dbp}[idx] -> dst32 ; clobbers idx(64)+tmp(64)+H.
	auto load_d24 = [&](a64::Gp dst, a64::Gp idx, a64::Gp tmp) {
		dmem_index(idx, tmp);
		lea_dev(d.dbp ? o.dmem1 : o.dmem0);
		a.ldr(dst.w(), a64::ptr(H, idx.x(), a64::lsl(2)));
	};
	// %c = cmem[cmode ? ca : param] (direct; jit_pooled_safe holds) -> dst32 ; clobbers tmp+H.
	// Then the CRM read view (match current_cmem_view(); scrm can flip it mid-frame -> runtime check).
	auto cmem_into = [&](a64::Gp dst, a64::Gp tmp) {
		if (d.cmode) {
			ldb(tmp, o.ca);
			lea_dev(o.cmem);
			a.ldr(dst.w(), a64::ptr(H, tmp.x(), a64::lsl(2)));
		} else {
			lea_dev(o.cmem);
			a.ldr(dst.w(), a64::ptr(H, r.param.x(), a64::lsl(2)));
		}
		ld32(tmp, o.st1);
		a.mov(H.w(), Imm(tms57002_device::jit_st1_crm()));
		a.and_(tmp.w(), tmp.w(), H.w());
		Label crm_16h = a.new_label(), crm_16l = a.new_label(), crm_done = a.new_label();
		a.mov(H.w(), Imm(tms57002_device::jit_st1_crm_16h()));
		a.cmp(tmp.w(), H.w());
		a.b_eq(crm_16h);
		a.mov(H.w(), Imm(tms57002_device::jit_st1_crm_16l()));
		a.cmp(tmp.w(), H.w());
		a.b_eq(crm_16l);
		a.b(crm_done);
		a.bind(crm_16h);
		a.mov(H.w(), Imm(0xffff0000u));
		a.and_(dst.w(), dst.w(), H.w());
		a.b(crm_done);
		a.bind(crm_16l);
		a.lsl(dst.w(), dst.w(), Imm(16));
		a.bind(crm_done);
	};
	// %a = aacc (<<7 if sfao) -> dst32.
	auto load_a = [&](a64::Gp dst) {
		a.mov(dst.w(), r.aacc.w());
		if (d.sfao) a.lsl(dst.w(), dst.w(), Imm(7));
	};
	// %wa(rr64) -> aacc(pinned): int32-overflow -> ST1_AOV; AOVM -> clamp. clobbers s1,s2,H.
	auto wa = [&](a64::Gp rr, a64::Gp s1, a64::Gp s2) {
		a.sxtw(s1.x(), rr.w());
		a.cmp(s1.x(), rr.x());
		Label noovf = a.new_label();
		a.b_eq(noovf);
		st1_rmw_or(tms57002_device::jit_st1_aov(), s1, s2);
		Label noclamp = a.new_label();
		ld32(s1, o.st1);
		a.mov(s2.w(), Imm(tms57002_device::jit_st1_aovm()));
		a.tst(s1.w(), s2.w());
		a.b_eq(noclamp);
		a.mov(s1.x(), Imm(2147483647LL));
		a.cmp(rr.x(), s1.x());
		a.csel(rr.x(), s1.x(), rr.x(), a64::CondCode::kGT);
		a.mov(s2.x(), Imm(-2147483648LL));
		a.cmp(rr.x(), s2.x());
		a.csel(rr.x(), s2.x(), rr.x(), a64::CondCode::kLT);
		a.bind(noclamp);
		a.bind(noovf);
		a.mov(r.aacc.w(), rr.w());
	};

	// %mo/%mn/%mv -> result in T0 (s64). Reads macc_read (pinned r.macc_r). Sets ST1_MOV and (movm)
	// clamps on overflow. kind: 'o'/'n'/'v'. Uses T0=result, T1=mr, T2=ov, T3/T4 scratch (+H via RMW).
	// Same constant tables as the x86 backend (incl. the fork RND-mode3 48-20 fix).
	auto macc_output = [&](char kind, unsigned sfmo, unsigned movm, unsigned rnd) {
		static const u64 PRE_MASK[4] = { 0xf800000000000ULL, 0xfe00000000000ULL, 0xff80000000000ULL, 0ULL };
		static const long long ROUNDING[5] = { 0, 0x8000, 0x800000, 0x8000000, 0x80000000LL };
		static const u64 RMASK[5] = { 0xffffffffffffffffULL, 0xffffffffffff0000ULL, 0xffffffffff000000ULL, 0xfffffffff0000000ULL, 0xffffffff00000000ULL };
		// MOVM clip is the 48-bit limit masked by the selected rounding mask.
		static const long long CLIP_POS[5] = { 0x00007fffffffffffLL, 0x00007fffffff0000LL, 0x00007fffff000000LL, 0x00007ffff0000000LL, 0x00007fff00000000LL };
		static const long long CLIP_NEG[5] = { (long long)0xffff800000000000ULL, (long long)0xffff800000000000ULL, (long long)0xffff800000000000ULL, (long long)0xffff800000000000ULL, (long long)0xffff800000000000ULL };
		const long long FIX_POS = 0x00007fffffffffffLL, FIX_NEG = (long long)0xffff800000000000ULL;
		const u64 POST_MASK = 0xf800000000000ULL;
		if (rnd > 4) rnd = 4;
		a.mov(T1.x(), r.macc_r.x());   // mr (for the sign test)
		a.mov(T0.x(), T1.x());         // m = macc_read
		a.mov(T2.x(), a64::xzr);       // ov = 0
		auto ovcheck = [&](u64 mask) {
			a.mov(T4.x(), Imm((long long)mask));
			a.ands(T3.x(), T0.x(), T4.x());
			Label no = a.new_label();
			a.b_eq(no);                 // (m & mask) == 0 -> not over
			a.cmp(T3.x(), T4.x());
			a.b_eq(no);                 // (m & mask) == mask -> not over
			a.mov(T2.x(), Imm(1));
			a.bind(no);
		};
		auto clamp = [&](bool table) {
			st1_rmw_or(tms57002_device::jit_st1_mov(), T3, T4);
			if (movm) {
				a.mov(T4.x(), Imm((long long)0x8000000000000ULL));
				a.and_(T3.x(), T1.x(), T4.x());   // neg = mr & topbit
				a.mov(T0.x(), Imm(table ? CLIP_POS[rnd] : FIX_POS));
				a.mov(T4.x(), Imm(table ? CLIP_NEG[rnd] : FIX_NEG));
				a.cmp(T3.x(), Imm(0));
				a.csel(T0.x(), T4.x(), T0.x(), a64::CondCode::kNE);
			}
		};
		if (kind == 'v') {
			if (sfmo != 3) {   // check_macc_overflow_3 returns macc_read unchanged
				ovcheck(PRE_MASK[sfmo]);
				Label noov = a.new_label();
				a.cbz(T2.x(), noov);
				clamp(false);
				a.bind(noov);
			}
			return;   // result in T0
		}
		if (sfmo != 3) ovcheck(PRE_MASK[sfmo]);
		if (sfmo == 1) a.lsl(T0.x(), T0.x(), Imm(2));
		else if (sfmo == 2) a.lsl(T0.x(), T0.x(), Imm(4));
		else if (sfmo == 3) a.asr(T0.x(), T0.x(), Imm(8));
		if (ROUNDING[rnd]) { a.mov(T3.x(), Imm(ROUNDING[rnd])); a.add(T0.x(), T0.x(), T3.x()); }
		a.mov(T3.x(), Imm((long long)RMASK[rnd]));
		a.and_(T0.x(), T0.x(), T3.x());
		ovcheck(POST_MASK);
		Label noov = a.new_label();
		a.cbz(T2.x(), noov);
		clamp(kind == 'o');
		a.bind(noov);
		// result in T0
	};

	// ---- flag-setters: st1 = (st1 & keep) | set (probe the oracle) -------------------------------
	if (d.type == 'f') {
		const void *icd = reinterpret_cast<const void *>(icd_addr);
		const u32 v0 = dsp.jit_probe_st1(op, icd, 0x00000000u);
		const u32 vF = dsp.jit_probe_st1(op, icd, 0xffffffffu);
		const u32 setb = v0, keep = vF & ~setb;
		if (keep == 0xffffffffu && setb == 0u)
			return;   // identity (x86 backend emits nothing here either)
		ld32(T0, o.st1);
		if (keep != 0xffffffffu) { a.mov(T1.w(), Imm(keep)); a.and_(T0.w(), T0.w(), T1.w()); }
		if (setb != 0u) { a.mov(T1.w(), Imm(setb)); a.orr(T0.w(), T0.w(), T1.w()); }
		st32(T0, o.st1);
		return;
	}
	// ---- trivial ----
	if (is("zmac")) { a.mov(r.macc.x(), a64::xzr); return; }
	if (is("zacc")) { a.mov(r.aacc.w(), a64::wzr); return; }
	if (is("lcak")) { stb(r.param, o.ca); return; }
	if (is("lirk")) { stb(r.param, o.id); return; }
	if (is("idle")) {
		ld32(T0, o.sti);
		a.mov(T1.w(), Imm(tms57002_device::jit_s_idle_mask()));
		a.orr(T0.w(), T0.w(), T1.w());
		st32(T0, o.sti);
		return;
	}
	if (is("lira")) { load_a(T0); a.lsr(T0.w(), T0.w(), Imm(24)); stb(T0, o.id); return; }
	if (is("lcaa")) { load_a(T0); a.lsr(T0.w(), T0.w(), Imm(24)); stb(T0, o.ca); return; }
	// ---- macc shift: sfml/sfmr ----
	if (is("sfml") || is("sfmr")) {
		a.mov(T1.x(), Imm(0x8000000000000LL));
		a.and_(T0.x(), r.macc.x(), T1.x());   // hi = macc & topbit
		if (is("sfml")) a.lsl(r.macc.x(), r.macc.x(), Imm(1));
		else a.lsr(r.macc.x(), r.macc.x(), Imm(1));
		a.mov(T1.x(), Imm(0x7ffffffffffffLL));
		a.and_(r.macc.x(), r.macc.x(), T1.x());
		a.orr(r.macc.x(), r.macc.x(), T0.x());
		return;
	}
	// ---- loads ----
	if (is("lacc")) { cmem_into(T0, T1); a.mov(r.aacc.w(), T0.w()); return; }
	if (is("lacd")) {
		load_d24(T0, T1, T2);
		a.lsl(T0.w(), T0.w(), Imm(8));
		if (d.sfai) a.asr(T0.w(), T0.w(), Imm(1));
		a.mov(r.aacc.w(), T0.w());
		return;
	}
	// ---- logic: and/or/xor (aacc is pinned -> operate on the register) ----
	if (is("and") || is("or") || is("xor")) {
		const unsigned base = is("and") ? 0x14 : is("or") ? 0x17 : 0x1a;
		const unsigned form = d.id - base;   // 0=%d,a 1=%c,a 2=%d,%c
		auto ap = [&](const a64::Gp &dst, const a64::Gp &src) {
			if (is("and")) a.and_(dst.w(), dst.w(), src.w());
			else if (is("or")) a.orr(dst.w(), dst.w(), src.w());
			else a.eor(dst.w(), dst.w(), src.w());
		};
		if (form == 1) {                                   // %c,a : aacc OP= %c
			cmem_into(T0, T1);
			ap(r.aacc, T0);
		} else {
			load_d24(T0, T1, T2);                          // %sfai(d,%d)
			a.lsl(T0.w(), T0.w(), Imm(8));
			if (d.sfai) a.asr(T0.w(), T0.w(), Imm(1));
			if (form == 0) {                               // %d,a : aacc OP= d
				ap(r.aacc, T0);
			} else {                                       // %d,%c : aacc = %c OP d
				cmem_into(T1, T3);
				ap(T1, T0);
				a.mov(r.aacc.w(), T1.w());
			}
		}
		return;
	}
	// ---- %wa arith: neg/abs/add/sub ----
	if (is("neg")) {
		load_a(T0);
		a.sxtw(T1.x(), T0.w());
		a.neg(T1.x(), T1.x());
		wa(T1, T2, T3);
		return;
	}
	if (is("abs")) {
		// .lst: `aacc = %a;` FIRST (unconditionally) — under sfao=1 aacc becomes aacc<<7 even when
		// positive (2026-07-05 audit; parity with the x86 body).
		load_a(T0);
		a.mov(r.aacc.w(), T0.w());
		Label done = a.new_label();
		a.tbz(T0.w(), Imm(31), done);      // %a >= 0 -> done
		a.neg(T0.w(), T0.w());
		a.mov(r.aacc.w(), T0.w());
		a.tbz(T0.w(), Imm(31), done);      // -%a >= 0 -> done
		st1_rmw_or(tms57002_device::jit_st1_aov(), T1, T2);
		if (dsp.jit_abs_saturate()) {
			a.mov(T1.w(), Imm(0x7fffffffu));
			a.mov(r.aacc.w(), T1.w());
		}
		else {
			Label no_clamp = a.new_label();
			ld32(T1, o.st1);
			a.mov(T2.w(), Imm(tms57002_device::jit_st1_aovm()));
			a.tst(T1.w(), T2.w());
			a.b_eq(no_clamp);
			a.mov(T1.w(), Imm(0x7fffffffu));
			a.mov(r.aacc.w(), T1.w());
			a.bind(no_clamp);
		}
		a.bind(done);
		return;
	}
	if (is("add") || is("sub")) {
		const unsigned lo = d.id & 0xf;
		const bool is_add = is("add");
		const bool mo_form = (lo == 0x05 || lo == 0x06 || lo == 0x0b || lo == 0x0c);
		if (!mo_form) {   // (int32)X OP (int32)Y -> %wa
			if ((is_add && lo == 0x03) || (!is_add && lo == 0x09)) {         // %d,a
				load_d24(T0, T1, T2);
				a.lsl(T0.w(), T0.w(), Imm(8));
				a.sxtw(T1.x(), T0.w());
				load_a(T0);
				a.sxtw(T2.x(), T0.w());
			} else if ((is_add && lo == 0x04) || (!is_add && lo == 0x0a)) {  // %c,a
				cmem_into(T0, T3);
				a.sxtw(T1.x(), T0.w());
				load_a(T0);
				a.sxtw(T2.x(), T0.w());
			} else {                                                          // 0x07 / 0x0d : %d,%c
				load_d24(T0, T1, T2);
				a.lsl(T0.w(), T0.w(), Imm(8));
				a.sxtw(T1.x(), T0.w());
				cmem_into(T0, T3);
				a.sxtw(T2.x(), T0.w());
			}
			if (is_add) a.add(T1.x(), T1.x(), T2.x());
			else a.sub(T1.x(), T1.x(), T2.x());
			wa(T1, T3, T4);
		} else {          // %d/%c , m : lhs(int32) OP (%mo>>16) -> %wa  (lhs kept in T5 across macc_output)
			const bool d_form = (lo == 0x05 || lo == 0x0b);
			if (d_form) {
				load_d24(T0, T1, T2);
				a.lsl(T0.w(), T0.w(), Imm(8));
				if (d.sfai) a.asr(T0.w(), T0.w(), Imm(1));
				a.sxtw(T5.x(), T0.w());
			} else {
				cmem_into(T0, T1);
				a.sxtw(T5.x(), T0.w());
			}
			macc_output('o', d.sfmo, d.movm, d.rnd);   // -> T0
			a.asr(T0.x(), T0.x(), Imm(16));
			if (is_add) a.add(T5.x(), T5.x(), T0.x());
			else a.sub(T5.x(), T5.x(), T0.x());
			wa(T5, T1, T2);
		}
		return;
	}
	// ---- mac / macs / macu / mpy / mpyu (sfma=0; cmem direct; forward modes excluded by the frame) ----
	if (is("mac") || is("macs") || is("macu") || is("mpy") || is("mpyu")) {
		int csrc, dsrc, shift; bool acc, cwrite;
		const unsigned id = d.id;
		if (is("mac")) { acc = true; cwrite = true;
			if (id == 0x24) { csrc = 0; dsrc = 0; shift = 7; } else if (id == 0x25) { csrc = 1; dsrc = 0; shift = 7; } else { csrc = 0; dsrc = 2; shift = 15; } }
		else if (is("macs")) { acc = true; cwrite = true; csrc = 0; dsrc = 2; shift = 14; }
		else if (is("macu")) { acc = true; cwrite = true; shift = 7; if (id == 0x29) { csrc = 0; dsrc = 1; } else { csrc = 1; dsrc = 1; } }
		else if (is("mpy")) { acc = false;
			if (id == 0x21) { csrc = 0; dsrc = 0; shift = 7; cwrite = true; } else if (id == 0x22) { csrc = 0; dsrc = 2; shift = 15; cwrite = true; } else { csrc = 2; dsrc = 0; shift = 7; cwrite = false; } }
		else { acc = false; cwrite = true; csrc = 0; dsrc = 1; shift = 7; }   // mpyu 0x28
		// The multiplier's A input is 24 bits. It receives %a only in the c,a forms (dsrc==2);
		// a,d routes %a to the full-width C input (csrc==1).
		auto mask_a = [&](a64::Gp v) {
			// and(w, w, imm) with 0xffffff00 IS encodable as an AArch64 logical-immediate (a rotated run of
			// ones), but go through H to stay safe from asmjit silently dropping a non-encodable imm.
			a.mov(H.w(), Imm(0xffffff00U));
			a.and_(v.w(), v.w(), H.w());
		};
		// c (T0.w) + optional creg write. csrc==1 receives the full %a view, including sfao<<7.
		if (csrc == 0) cmem_into(T0, T1);
		else if (csrc == 1) load_a(T0);
		else ld32(T0, o.creg);
		if (cwrite) st32(T0, o.creg);
		// r = (int64)(int32)c * (int64)d  -> T2 * T3
		a.sxtw(T2.x(), T0.w());
		if (dsrc == 2) {
			load_a(T4);                  // d-side %a: sfao<<7 applies before the (int32) cast
			mask_a(T4);                  // ...then the 24-bit A-port truncation, before the cast
			a.sxtw(T3.x(), T4.w());
		} else {
			load_d24(T4, T1, T5);
			if (dsrc == 0) {             // signed 24-bit: sign-extend bit23
				a.lsl(T4.w(), T4.w(), Imm(8));
				a.asr(T4.w(), T4.w(), Imm(8));
				a.sxtw(T3.x(), T4.w());
			} else {                     // unsigned 24-bit (zero-extend)
				a.mov(T3.w(), T4.w());
			}
		}
		a.mul(T2.x(), T2.x(), T3.x());
		a.asr(T2.x(), T2.x(), Imm(shift));
		if (acc) a.add(r.macc.x(), r.macc.x(), T2.x());
		else a.mov(r.macc.x(), T2.x());
		return;
	}
	// ---- macc loads: lmhc / lmhd / lmld (write macc AND macc_write pinned) ----
	if (is("lmhc")) {
		cmem_into(T0, T1);
		a.sxtw(T2.x(), T0.w());
		a.lsl(T2.x(), T2.x(), Imm(16));
		a.mov(r.macc.x(), T2.x());
		a.mov(r.macc_w.x(), T2.x());
		return;
	}
	if (is("lmhd")) {
		load_d24(T0, T1, T2);
		a.lsl(T0.w(), T0.w(), Imm(8));
		a.sxtw(T2.x(), T0.w());
		a.lsl(T2.x(), T2.x(), Imm(16));
		a.mov(r.macc.x(), T2.x());
		a.mov(r.macc_w.x(), T2.x());
		return;
	}
	if (is("lmld")) {
		load_d24(T0, T1, T2);
		a.mov(T2.x(), Imm((long long)~0xffffffLL));
		a.and_(T1.x(), r.macc.x(), T2.x());
		a.mov(T3.w(), T0.w());     // zero-extend %d24
		a.orr(T1.x(), T1.x(), T3.x());
		a.mov(r.macc.x(), T1.x());
		a.mov(r.macc_w.x(), T1.x());
		return;
	}
	// ---- macc-output writes: smhc (%wc) / smhd,smld,slmh,slml (%wd), via %mo/%mn/%mv ----
	if (is("smhc")) {
		macc_output('o', d.sfmo, d.movm, d.rnd);
		a.asr(T0.x(), T0.x(), Imm(16));
		if (const int tb = dsp.jit_smhc_trunc_bits()) {   // fork silicon fix: high-bits-only store
			a.mov(T1.w(), Imm(u32(~((1u << tb) - 1))));
			a.and_(T0.w(), T0.w(), T1.w());
		}
		if (d.cmode) {
			ldb(T1, o.ca);
			lea_dev(o.cmem);
			a.str(T0.w(), a64::ptr(H, T1.x(), a64::lsl(2)));
		} else {
			lea_dev(o.cmem);
			a.str(T0.w(), a64::ptr(H, r.param.x(), a64::lsl(2)));
		}
		return;
	}
	if (is("smhd") || is("smld") || is("slmh") || is("slml")) {
		char kind; int sh; unsigned mask;
		if (is("smhd")) { kind = dsp.jit_smhd_raw_path() ? 'v' : 'o'; sh = 24; mask = 0xffffff; }
		// smld stores MACC[23:0] — NO shift. 44e255ea05e fixed the interpreter's spurious >>8 (which
		// wrote MACC[31:8]); this emitter kept the stale shift and so diverged. sh=0 = parity.
		else if (is("smld")) { kind = 'v'; sh = 0; mask = 0xffffff; }
		else if (is("slmh")) { kind = 'v'; sh = 24; mask = 0xffff00; }
		else { kind = 'v'; sh = 8; mask = 0xffffff; }   // slml
		macc_output(kind, d.sfmo, d.movm, d.rnd);
		if (sh) a.asr(T0.x(), T0.x(), Imm(sh));
		a.mov(T3.w(), Imm(mask));
		a.and_(T0.w(), T0.w(), T3.w());
		dmem_index(T1, T2);
		lea_dev(d.dbp ? o.dmem1 : o.dmem0);
		a.str(T0.w(), a64::ptr(H, T1.x(), a64::lsl(2)));
		return;
	}
	// ---- writes ----
	if (is("sacc")) {
		load_a(T0);
		if (d.cmode) {
			ldb(T1, o.ca);
			lea_dev(o.cmem);
			a.str(T0.w(), a64::ptr(H, T1.x(), a64::lsl(2)));
		} else {
			lea_dev(o.cmem);
			a.str(T0.w(), a64::ptr(H, r.param.x(), a64::lsl(2)));
		}
		return;
	}
	if (is("sacd")) {
		load_a(T0);
		a.lsr(T0.w(), T0.w(), Imm(8));
		a.mov(T3.w(), Imm(0xffffffu));
		a.and_(T0.w(), T0.w(), T3.w());
		dmem_index(T1, T2);
		lea_dev(d.dbp ? o.dmem1 : o.dmem0);
		a.str(T0.w(), a64::ptr(H, T1.x(), a64::lsl(2)));
		return;
	}
	if (is("srbd")) {
		ld32(T0, o.xrd);
		a.mov(T3.w(), Imm(0xffffffu));
		a.and_(T0.w(), T0.w(), T3.w());
		dmem_index(T1, T2);
		lea_dev(d.dbp ? o.dmem1 : o.dmem0);
		a.str(T0.w(), a64::ptr(H, T1.x(), a64::lsl(2)));
		return;
	}
	// ---- serial output: dos (so[n]=%d24) / domh (so[n]=(%mo>>24)&0xffffff). n = opcode id & 3. ----
	if (is("dos")) {
		const int n = int(d.id & 3);
		load_d24(T0, T1, T2);
		a.mov(T3.w(), Imm(0xffffffu));
		a.and_(T0.w(), T0.w(), T3.w());
		st32(T0, o.so + n * 4);
		return;
	}
	if (is("domh")) {
		const int n = int(d.id & 3);
		macc_output('o', d.sfmo, d.movm, d.rnd);
		a.asr(T0.x(), T0.x(), Imm(24));
		a.mov(T3.w(), Imm(0xffffffu));
		a.and_(T0.w(), T0.w(), T3.w());
		st32(T0, o.so + n * 4);
		return;
	}
	// (unused in pooled bodies but kept referenced for parity notes)
	(void)o.xoa; (void)o.xwr; (void)ld64; (void)st64;
}

}  // namespace tms57002

#endif  // __aarch64__
